Revit 2027 API
AnalyticalSystemDomain Enumeration
 The domain type of analytical system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalSystemDomain
Public Enumeration AnalyticalSystemDomain
public enum class AnalyticalSystemDomain
type AnalyticalSystemDomain
Members
Member name | Value | Description
AirSystem | 1
ElectricalSystem | 2
WaterLoop | 0
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace